import { mapObjectKeys } from '../utils/map.js';

const departments = {
    // ИКТИБ
    ОИД: 0,
    БИТ: 1,
    ИИТиС: 2,
    ВТ: 3,
    ИАСБ: 4,
    ИБТКС: 5,
    ИМС: 6,
    'МОП ЭВМ': 7,
    ПиБЖ: 8,
    САИТ: 9,
    САПР: 10,
    СиПУ: 11,
    ФМОИО: 12,
    // ИНЕП
    НТМСТ: 13,
    РТЭН: 14,
    ТБХ: 15,
    ЭГАиМТ: 16,
    // ИРТСУ
    АиРПУ: 17,
    ТОР: 18,
    РТС: 19,
    ВиРС: 20,
    ЛА: 21,
    ИГиКД: 22,  
    САУ: 23,
    ЭиМ: 24,
    // ИУЭС
    ГиМУ: 25,
    ИЭ: 26,
    ИЯ: 27,
    ЛО: 28,
    МиИТ: 29,
    ФЛ: 30,
    ЭП: 31,
    // Институт военного обучения
    ФВ: 32,
    // Филиал ЮФУ в г. Новошахтинске
    ИиМ: 33,
    МиЭ: 34,
    СРиПО: 35,
    // Дирекция
    ДИР: 99,
};

export default departments;

export const map = mapObjectKeys(departments);
