// Тестовые часы у Доцента
export default {
    Ассистент: {
        max: 900,
        min: 250,
    },
    Преподаватель: {
        max: 900,
        min: 250,
    },
    'Директор института': {
        max: 250,
        min: 0,
    },
    Доцент: {
        max: 100,
        min: 50,
    },
    'Заведующий кафедрой': {
        max: 650,
        min: 100,
    },
    Профессор: {
        max: 700,
        min: 120,
    },
    'Старший преподаватель': {
        max: 850,
        min: 200,
    },
    'Главный научный сотрудник': {
        max: 200,
        min: 0,
    },
    'Старший научный сотрудник': {
        max: 200,
        min: 0,
    },
    'Ведущий научный сотрудник': {
        max: 200,
        min: 0,
    },
    'Научный сотрудник': {
        max: 200,
        min: 0,
    },
};
