//! методы и роли которые могут ими пользоваться
const metods = [
  {
    id: 1,
    name: "Получение всех преподавателей",
  },
  {
    id: 2,
    name: "Получение преподавателей по своей кафедре",
  },
  {
    id: 3,
    name: "Доступ к таблице преподавателей",
  },
  {
    id: 4,
    name: "Создание преподавателя",
  },
  {
    id: 8,
    name: "Обновление данных нагрузки",
  },
  {
    id: 9,
    name: "Добавление преподавателя на нагрузку",
  },
  {
    id: 10,
    name: "Удаление преподавателя с нагрузки",
  },
  {
    id: 11,
    name: "Разделение нагрузки",
  },
  {
    id: 12,
    name: "Соединение нагрузки",
  },
  {
    id: 13,
    name: "Удаление нагрузки",
  },
  {
    id: 14,
    name: "Получение всех нагрузок",
  },
  {
    id: 15,
    name: "Получение нагрузок по кафедре",
  },

  {
    id: 17,
    name: "Получение всех предложений",
  },
  {
    id: 18,
    name: "Предложить преподавателя",
  },
  {
    id: 20,
    name: "Получить все комментарии к нагрузке ",
  },
  {
    id: 21,
    name: "Удаление комментариев ",
  },
  {
    id: 22,
    name: "Создать комментраий ",
  },
  {
    id: 23,
    name: "Получение предупреждений",
  },
  {
    id: 24,
    name: "Открытие личного кабинета",
  },
  {
    id: 25,
    name: "Кнопка отменить действие",
  },
  {
    id: 26,
    name: "Кнопка сохранения",
  },
  {
    id: 27,
    name: "Кнопка отправить таблицу",
  },
];
