export const addWorkload = [
  {
    name: "Руководство НИР магистра 1 года",
    hors: 15,
  },
  {
    name: "Руководство НР аспиранта",
    hors: 40,
  },
  {
    name: "Руководство НИР аспиранта",
    hors: 40,
  },
  {
    name: "Руководство ВКР аспиранта",
    hors: 50,
  },
  {
    name: "Руководство ВКР бакалавра",
    hors: 15,
  },
  {
    name: "Руководство ВКР магистранта",
    hors: 20,
  },
  {
    name: "Руководство ВКР магистра",
    hors: 20,
  },
  {
    name: "Руководство ВКР специалиста",
    hors: 20,
  },
  {
    name: "Рецензирование ВКР магистра",
    hors: 4,
  },
  {
    name: "Рецензирование ВКР специалиста",
    hors: 4,
  },
  {
    name: "Рецензирование НД аспиранта",
    hors: 4,
  },
];
