export const addWorkload = [
  //! Руководство НИР магистра 1 года очка
  {
    name: "Руководство НИР магистра",
    hors: 15,
  },
  {
    name: "Руководство НИР магистра 1 года",
    hors: 15,
  },
  {
    name: "Руководство НИР магистра 1 года обучения",
    hors: 15,
  },
  {
    name: "Руководство НИР магистра (очная форма обучения)",
    hors: 15,
  },
  {
    name: "Руководство НИР магистра 1 года (очная форма обучения)",
    hors: 15,
  },
  {
    name: "Руководство НИР магистра 1 года обучения (очная форма обучения)",
    hors: 15,
  },

  //! Руководство НИР магистра 1 года очка на иностранном языке
  {
    name: "Руководство НИР магистра при выполнении работы на иностранном языке",
    hors: 30,
  },
  {
    name: "Руководство НИР магистра 1 года при выполнении работы на иностранном языке",
    hors: 30,
  },
  {
    name: "Руководство НИР магистра 1 года обучения при выполнении работы на иностранном языке",
    hors: 30,
  },
  {
    name: "Руководство НИР магистра при выполнении работы на иностранном языке (очная форма обучения)",
    hors: 30,
  },
  {
    name: "Руководство НИР магистра 1 года при выполнении работы на иностранном языке (очная форма обучения)",
    hors: 30,
  },
  {
    name: "Руководство НИР магистра 1 года обучения при выполнении работы на иностранном языке (очная форма обучения)",
    hors: 30,
  },

  //! Руководство НИР магистра 1, 2 года очка
  {
    name: "Руководство НИР магистра 1, 2 года",
    hors: 30,
  },
  {
    name: "Руководство НИР магистра 1, 2 года обучения",
    hors: 30,
  },
  {
    name: "Руководство НИР магистра 1, 2 года (очная форма обучения)",
    hors: 30,
  },
  {
    name: "Руководство НИР магистра 1, 2 года обучения (очная форма обучения)",
    hors: 30,
  },

  //! Руководство НИР магистра 1, 2 года очка на иностранном
  {
    name: "Руководство НИР магистра 1, 2 года при выполнении работы на иностранном языке",
    hors: 60,
  },
  {
    name: "Руководство НИР магистра 1, 2 года обучения при выполнении работы на иностранном языке",
    hors: 60,
  },
  {
    name: "Руководство НИР магистра 1, 2 года при выполнении работы на иностранном языке (очная форма обучения)",
    hors: 60,
  },
  {
    name: "Руководство НИР магистра 1, 2 года обучения при выполнении работы на иностранном языке (очная форма обучения)",
    hors: 60,
  },

  //! Руководство НИР магистра заочка
  {
    name: "Руководство НИР магистра (заочная форма обучения)",
    hors: 10,
  },
  {
    name: "Руководство НИР магистра (очно-заочная форма обучения)",
    hors: 10,
  },

  {
    name: "Руководство НИР магистра 1 года (заочная форма обучения)",
    hors: 10,
  },
  {
    name: "Руководство НИР магистра 1 года (очно-заочная форма обучения)",
    hors: 10,
  },

  {
    name: "Руководство НИР магистра 1, 2 года (заочная форма обучения)",
    hors: 20,
  },
  {
    name: "Руководство НИР магистра 1, 2 года (очно-заочная форма обучения)",
    hors: 20,
  },

  //! Руководство НИР магистра заочка ин яз
  {
    name: "Руководство НИР магистра при выполнении работы на иностранном языке (заочная форма обучения)",
    hors: 20,
  },
  {
    name: "Руководство НИР магистра при выполнении работы на иностранном языке (очно-заочная форма обучения)",
    hors: 20,
  },

  {
    name: "Руководство НИР магистра 1 года при выполнении работы на иностранном языке (заочная форма обучения)",
    hors: 20,
  },
  {
    name: "Руководство НИР магистра 1 года при выполнении работы на иностранном языке (очно-заочная форма обучения)",
    hors: 20,
  },

  {
    name: "Руководство НИР магистра 1, 2 года при выполнении работы на иностранном языке (заочная форма обучения)",
    hors: 40,
  },
  {
    name: "Руководство НИР магистра 1, 2 года при выполнении работы на иностранном языке (очно-заочная форма обучения)",
    hors: 40,
  },

  //! Руководство научной работой аспиранта
  {
    name: "Руководство научной работой аспиранта",
    hors: 40,
  },
  {
    name: "Руководство научной работой аспиранта при выполнении работы на иностранном языке",
    hors: 80,
  },
  {
    name: "Руководство научной работой аспиранта 1 года обучения",
    hors: 40,
  },
  {
    name: "Руководство научной работой аспиранта 1 года обучения при выполнении работы на иностранном языке",
    hors: 80,
  },

  {
    name: "Руководство научной работой аспиранта 1, 2 года обучения",
    hors: 50,
  },
  {
    name: "Руководство научной работой аспиранта 1, 2 года обучения при выполнении работы на иностранном языке",
    hors: 100,
  },

  //! ВКР

  {
    name: "Руководство ВКР аспиранта",
    hors: 50,
  },
  {
    name: "Руководство ВКР аспиранта при выполнении работы на иностранном языке",
    hors: 100,
  },

  {
    name: "Руководство ВКР магистра",
    hors: 20,
  },
  {
    name: "Руководство ВКР магистра при выполнении работы на иностранном языке",
    hors: 40,
  },

  {
    name: "Руководство ВКР специалиста",
    hors: 20,
  },
  {
    name: "Руководство ВКР специалиста при выполнении работы на иностранном языке",
    hors: 40,
  },

  {
    name: "Руководство ВКР бакалавра",
    hors: 15,
  },
  {
    name: "Руководство ВКР бакалавра при выполнении работы на иностранном языке",
    hors: 30,
  },

  //! рецензирование ВКР
  {
    name: "Рецензирование ВКР магистра",
    hors: 4,
  },
  {
    name: "Рецензирование ВКР магистра при выполнении работы на иностранном языке",
    hors: 8,
  },

  {
    name: "Рецензирование ВКР специалиста",
    hors: 4,
  },
  {
    name: "Рецензирование ВКР специалиста при выполнении работы на иностранном языке",
    hors: 8,
  },

  {
    name: "Рецензирование НД аспиранта",
    hors: 4,
  },
  {
    name: "Рецензирование научного доклада аспиранта",
    hors: 4,
  },

  {
    name: "Рецензирование НД аспиранта при выполнении работы на иностранном языке",
    hors: 8,
  },
  {
    name: "Рецензирование научного доклада аспиранта при выполнении работы на иностранном языке",
    hors: 8,
  },
];
