export const horsTeacher = [
    {
        name:"Преподаватель",
        max: 900,
        min: 250
    },
    {
        name:"Директор института",
        max: 600,
        min: 70,
    },
    {
        name:"Доцент",
        max: 800,
        min: 150
    },
    {
        name:"Заведующий кафедрой",
        max: 650,
        min: 100
    },
    {
        name:"Профессор",
        max: 700,
        min: 120
    },
    {
        name:"Старший преподаватель",
        max: 850,
        min: 200
    },
    {
        name:"Ведущий научный сотрудник",
        max: 240,
        min: 0
    },
    {
        name:"Главный научный сотрудник",
        max: 240,
        min: 0
    },
    {
        name:"Старший научный сотрудник",
        max: 240,
        min: 0
    },
    {
        name:"Ведущий научный сотрудник",
        max: 240,
        min: 0
    },
    {
        name:"Ассистент",
        max: 900,
        min: 250
    },
]